
###############################################################################
#
#   [10]. 아래 정보를 파이썬 딕셔너리 형태로 표현하고, 생성한 딕셔너리를 화면에 출력하시오.
#
#   '음료': 자몽 주스, 라임 소다
#   '빵': 모닝롤, 사과 파이
#   '면': 불닭볶음면, 진라면
#
###############################################################################

products = {
  '음료' : ['자몽 주스','라임 소다'],
  '빵': ['모닝롤', '사과 파이'],
  '면': ['불닭볶음면', '진라면']
}
print(products)

# 아래와 같은 방법도 있다. 
products = {}
products["음료"] = ['자몽 주스','라임 소다']
products['빵'] =  ['모닝롤', '사과 파이']
products['면'] = ['불닭볶음면', '진라']

print(products)