
###############################################################################
#
#   [9]. 문제 [8]에서 생성한 구구단에서 4단을 화면에 출력하는 파이썬 코드를 작성하시오.
#
###############################################################################

numberMatrix2 = [2, 4, 6, 8, 10, 12, 14, 16, 18]
numberMatrix3 = [3, 6, 9, 12, 15, 18, 21, 24, 27]
numberMatrix4 = [4, 8, 12, 16, 20, 24, 28, 32, 36]
numberMatrix5 = [5, 10, 15, 20, 25, 30, 35, 40, 45]
numberMatrix = [numberMatrix2,numberMatrix3,numberMatrix4,numberMatrix5]

print(numberMatrix[2])