
#######################################################################################
#
#   4. while 반복문을 이용하여 아래 기능을 수행하는 파이썬 반복문을 작성하시오.
#   ① 아래 동작을 계속(무한히) 반복한다.
#   ② 파이썬의 input()을 이용하여 사용자로부터 키보드 입력을 받는다.
#   ③ 입력받은 값이 0보다 큰(>) 경우 입력값을 화면에 출력하고 다시 키보드 입력을 대기한다.
#   ④ 입력받은 값이 0 이하(<=)인 경우 반복을 중지하고 프로그램을 끝낸다.
#   
#######################################################################################

while True:
    inputNum = int(input('숫자를 입력하세요: '))    #   사용자로부터 키보드 입력을 받습니다.

    if :

    else:
