
###############################################################################
#
#   4. 아래는 어느 주차장의 자동 요금 계산기의 조건들이다.
#   주차요금을 계산하는 조건문을 if-else 구문만을 사용하여 구성하시오.
#
#   조건 1: 1톤 미만(<)의 차량(소형차)은 주차요금으로 2,000원을 받습니다.
#   조건 2: 1톤 이상(>=) 2톤 미만(<)의 차량(중형차)은 주차요금으로 3,000원을 받습니다.
#   조건 3: 그 외 차량(대형차)은 주차요금으로 5,000원을 받습니다.
#
###############################################################################

carWeight = 1.5     #   in tons

if carWeight >= 1:
    if  carWeight < 2 :    #   중형차
        print('주차 요금은 3,000원입니다.')
    else:   #   대형차
        print('주차 요금은 5,000원입니다.')
else:   #   소형차
    print('주차 요금은 2,000원입니다.')
