#######################################################################################
#
#   5. 1~9의 숫자로 구성된 리스트를 생성하고(문제 1, 문제 2 방법 중 어떤 방법도 좋음),
#   enumerate() 함수와 for 반복문을 이용하여 리스트의 인덱스와 값(원소)의 쌍을 화면에 출력하시오.
#
#######################################################################################
oneToNine = list(range(1,10))
for  idx, item in enumerate(oneToNine) :
    print()


#######################################################################################
#
#   6. enumerate() 함수와 for 반복문을 이용하여 위 문제 5에서 생성한 리스트에서 홀수 번째 위치의
#   값(원소)들 만 화면에 출력하시오.
#
#######################################################################################
oneToNine = list(range(1,10))
for  idx, item in enumerate(oneToNine) :
    if idx%2 ==1: # 인덱스가 홀수 => 짝수번째 위치 원소
        continue
    else:
        print(item) # 짝수 인덱스 ->홀수번째 위치 인덱스 
