
#######################################################################################
#
#   1. 1~10의 숫자로 이루어진 리스트에서 for 반복문을 이용해서 리스트의 원소들을 출력하시오.
#
#######################################################################################

numUnderTen = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

for :
    print()


#######################################################################################
#
#   2. 1~10의 숫자로 이루어진 리스트를 range() 함수를 이용해서 생성하고,
#   생성한 리스트의 원소들을 for 반복문을 이용해서 출력하시오.
#
#######################################################################################

numUnderTen2 =
# print('numUnerTen2:', numUnerTen2)

for :
    print()


#######################################################################################
#
#   3. 1~10의 숫자로 구성된 리스트를 생성하고(문제 1, 문제 2 방법 중 어떤 방법도 좋음),
#   for 반복문과 if-else 조건문을 이용하여 리스트에서 짝수 만 출력하시오.
#
#######################################################################################

numUnderTen3 =

for item in numUnderTen3:
    if :
        continue
    else:
        print()


#######################################################################################
#
#   4. 1~9의 숫자로 구성된 리스트를 생성하고(문제 1, 문제 2 방법 중 어떤 방법도 좋음),
#   생성한 리스트와 for 반복문을 이용하여 구구단을 만들고 화면에 출력하시오
#
#######################################################################################

oneToNine =

for :
    for :
        print(num1*num2, end=' ')
    print('')


#######################################################################################
#
#   5. 1~9의 숫자로 구성된 리스트를 생성하고(문제 1, 문제 2 방법 중 어떤 방법도 좋음),
#   enumerate() 함수와 for 반복문을 이용하여 리스트의 인덱스와 값(원소)의 쌍을 화면에 출력하시오.
#
#######################################################################################

for  in :
    print()


#######################################################################################
#
#   6. enumerate() 함수와 for 반복문을 이용하여 위 문제 5에서 생성한 리스트에서 홀수 번째 위치의
#   값(원소)들 만 화면에 출력하시오.
#
#######################################################################################

for  in :
    if :
        continue
    else:
        print()


#######################################################################################
#
#   7. 1~9의 숫자로 구성된 리스트를 생성하고(문제 1, 문제 2 방법 중 어떤 방법도 좋음),
#   enumerate() 함수와 for 반복문을 이용하여 구구단의 홀수단 만 화면에 출력하는 코드를 작성하시오.
#
#######################################################################################

